thema2/api-app/app/controllers/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "item1"], ["done", nil], ["todo_id", 5], ["created_at", "2023-02-06 12:39:59.598225"], ["updated_at", "2023-02-06 12:39:59.598225"]]
---
  def create
    @todo.items.create!(item_params)

UPDATE "items" SET "done" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["done", 1], ["updated_at", "2023-02-06 16:56:59.365077"], ["id", 5]]
---
  def update
    @item.update(item_params)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.find(params[:todo_id])

SELECT "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo