thema2/api-app/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY created_at DESC
---
  def index
    todos = Todo.order('created_at DESC');

INSERT INTO "todos" ("title", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This thing"], ["username", "I wish it was not me"], ["created_at", "2023-02-06 15:30:38.176513"], ["updated_at", "2023-02-06 15:30:38.176513"]]
---
  def create
    #initializes record but doesn't add it to database yet
    todo = Todo.new(todo_params)

    if todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    todo =Todo.find(params[:id])

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "username" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Beethoven"], ["username", "someone"], ["updated_at", "2023-02-06 15:51:24.648110"], ["id", 1]]
---
  def update
    todo =Todo.find(params[:id])
    if todo.update(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
  def destroy

    todo = Todo.find(params[:id])
    todo.destroy